[
  {
    "path": "posts/2023-01-29-bike-share-analysis-using-r/",
    "title": "Bike Share Marketing Campaigns Analysis using R",
    "description": "Investigate a bike-share company's marketing campaigns in order to create a new one that is more profitable for the company.",
    "author": [
      {
        "name": "Miftahul Hadi",
        "url": {}
      }
    ],
    "date": "2023-01-29",
    "categories": [
      "R",
      "Marketing Analysis",
      "Data Visualization"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nPreparation\r\nAnalysis\r\nConclusion\r\nExternal links\r\n\r\nIntroduction\r\nPreparation\r\nAnalysis\r\nConclusion\r\nExternal links\r\nFor presentable data analysis, here’s the PPT\r\n\r\n\r\n\r\n",
    "preview": "https://storage.googleapis.com/gweb-uniblog-publish-prod/original_images/image1_hH9B4gs.jpg",
    "last_modified": "2023-01-30T10:07:02+07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-12-20-world-co2-emissions-growth-using-tableau/",
    "title": "World CO₂ Emissions Growth with Dashboard using Tableau",
    "description": "A guide to create an effective and clear dashboard for better understand average CO₂ in the world using CO₂ dataset.",
    "author": [
      {
        "name": "Miftahul Hadi",
        "url": {}
      }
    ],
    "date": "2022-12-20",
    "categories": [
      "Tableau",
      "Data Visualization"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nPreparation\r\nCreate a Dashboard\r\nAnalysis\r\nConclusion\r\n\r\n\r\n\r\n\r\n\r\nIntroduction\r\nAccording to the World Meteorological Organization’s (WMO), the past eight years are the warmest Earth temperature on record. To better understand about this climate changes, I want to design a dashboard about World CO₂ Emissions Growth. This dashboard will review the average CO₂ that produced in every country. Then, we try to investigate the production growth over the year in every region. Hopefully, this dashboard will be beneficial to reduces and mitigates the effects of global climate changes.\r\nFig. 1. The spreading of factory residueHere, we used the data sets from The World Bank Group, a world organization that work to reduce poverty in a country. This data sets include several variable such as:\r\nCountry Name\r\nYear of CO₂ collected\r\nCO₂ per Capita.\r\nWhat to analyze?\r\nThis data set can be used to find a questions that might arise such as:\r\nWhich country/region has the most average CO₂ per capita?\r\nWhat region has the highest growth of CO₂ emitters?\r\nHopefully, this questions will be a step to reveal what inside the data sets and helps other countries to mitigate the global climate changes.\r\nPreparation\r\nHere, I want to describe a few tools used in this analysis:\r\nTableau Public\r\nExcel (for storing data)\r\nCO₂ Dataset\r\nCreate a Dashboard\r\nHere’s a step-by-step to create a clear dashboard about CO₂ growth. You can click every step to show the detailed :\r\nLoad the Dataset\r\nTo connect the dataset to Tableau, the step as follows:\r\nFirst, open Tableau Public application.\r\nThen, the first window you see might be like this.\r\n\r\n\r\n\r\nSelect Microsoft Excel (because our dataset is in excel format), then locate to the dataset file.\r\nNext, a lot of sheet inside of dataset will appear. This is Data Source window.\r\n\r\n\r\n\r\nConnect the Tableau to useful sheet that already been cleaned. Here, we choose CO2 Data Cleaned because the sheet involves metrics needed.\r\nLast, we can go to worksheet\r\n\r\n\r\n\r\nAs a preview, here is a view of Tableau project we work on.\r\n\r\n\r\n\r\nAs the image above, there are three sections that show up, including:\r\nLeft-side = Where the data stored.\r\nMiddle = Tools to refine your data visualization.\r\nRight-side = Place to view your visualization.\r\nCreate a Graph\r\nIn this section, we want plotting the dataset about CO₂ activity in the World to answers question.\r\nAverage CO₂ per Capita\r\nHere’s the step to create a clear graph of average CO₂ for every country:\r\nFirst, we put the Country Name column to Detail in Marks pane.\r\n\r\n\r\n\r\nA map will appear with the country as a data points.\r\n\r\n\r\n\r\nThen, we calculate the average CO₂ per Capita for every country by drag the CO2 Per Capita (metric tons) column to Size in Marks pane.\r\n\r\n\r\n\r\nAverage of CO₂ per Capita will appear with circle size. The larger the circle, the highest average.\r\n\r\n\r\n\r\nThen, we can add a color divergence on the circle to make the average CO₂ per capita more clear.\r\n\r\n\r\n\r\nThen, we can see the divergence of color in the circle. The higher the blue concentrate, higher the average.\r\n\r\n\r\n\r\nTo make it more clear, we can change the color from Blue to Red-Green.\r\nClick Edit Colors, make the colors reversed, because green indicate low CO₂ and red for high CO₂. Make the center to 4.\r\n\r\n\r\n\r\nMake the size of the circle correlated to average CO₂ per Capita.\r\n\r\n\r\n\r\nAdd a border color on circle.\r\n\r\n\r\n\r\nChange the title and this is the first graph for Average CO₂ per Capita.\r\n\r\n\r\n\r\nCO₂ Production by Region\r\nHere’s the step to a viz about CO₂ production over the years:\r\nFirst, add a new worksheet for different graph.\r\n\r\n\r\n\r\nAdd Region column on color marks.\r\n\r\n\r\n\r\nThen, add Year as a columns & CO2 (kt) as a rows.\r\n\r\n\r\n\r\nHere’s the graph. You see that the year is too crowded.\r\n\r\n\r\n\r\nMake it only per 10 years by ranges.\r\n\r\n\r\n\r\nThere you go. Here the graph explain about CO₂ production by Region\r\n\r\n\r\n\r\nNext, we can combine this two graph to design a clear dashboard.\r\nDesign the dashboard\r\nIn this section, we want to combine two graph we have created into one dashboard. Here’s the step:\r\nFirst, create a new dashboard.\r\n\r\n\r\n\r\nLet’s add two graph we’ve created before by dragging the sheet into canvas.\r\n\r\n\r\n\r\nAfter dragging two graph. Then, it will looks like this.\r\n\r\n\r\n\r\nNotice that the legend is kind of confusing. Let’s move it into the relevant graph.\r\nTo move the legend, first click More options, then choose Floating.\r\n\r\n\r\n\r\nDo this with color divergence legend. Delete the circle legend.\r\nThen, remove the unused container to make the dashboard more clear.\r\n\r\n\r\n\r\nFinal dashboard\r\nHere’s the final dashboard that we have created.\r\n\r\n\r\n\r\nNow, the legend is tied with each graph. It’s give a context to graph and make the dashboard more clear.\r\nAnalysis\r\nAverage CO₂ per capita\r\n\r\n\r\n\r\nThis graph describes the average of CO₂ per capita in every country, between 1960 and 2011. The circle shows where the country is. Darker red or bigger circles indicate the country produces more CO₂ than the others. Darker the green or smaller circles, the less CO₂ to be produced.\r\nFrom the graph above, we can see that the Middle-east country has the highest average CO₂ per capita. For example, Qatar (one of the Middle-east countries) has an average of 54.42 tons per capita. It means that Qatari people have produced more CO₂ than any other country in the world. This is because of Qatar’s heavy reliance on gas and oil and has relatively small population when compared to other countries. This make the average larger. There’s also UAE (31.84 tons), Kuwait (28.4 tons), Bahrain (19.87 tons), and others.\r\nOn the opposite, most of Africa and South America country has the lowest average CO₂ per capita. Chad (one of the African countries) has the average of 0.03 tons per capita, the lowest in the world.\r\nGrowth of CO₂ emitters\r\n\r\n\r\n\r\nThis graph describes the CO₂ production growth in a number of regions between 1960 and 2011. Here, the CO₂ production is measured by kilo ton (kt). Each region shows in a colored line.\r\nFrom the graph above, each region tend to produce more CO₂ every year. In 1960, the highest CO₂ emitter is North America region. But 50 years later, East Asia & Pacific has produces more CO₂ than any others region.\r\n\r\n\r\n\r\nIn the graph above, we can see the rapid increase of CO₂ production in East Asia & Pacific from 1960 to 2011. In 1960, the CO₂ production is about 1,17 billion tons. 40 years later, the production is increased by 6 times (6,34 billion tons). It took only 10 years later to get 12,74 billion tons. This indicates that the increase rate of CO₂ production in East Asia & Pacific is significant.\r\nConclusion\r\nAccording to this analysis, we find that Qatar’s reliance on Gas and Oil makes the country the highest average of CO₂ per capita with 54.42 tons produced. But, the growth of CO₂ production in East Asia & Pacific should be wary with only 10 years from 2000, the CO₂ production increased 2 times higher by 12,74 billion tons.\r\nSuggestion\r\nFor the next analysis, a population dataset is needed for better little-bias analysis. Because, Qatar with less population could get a higher average of CO₂ per capita than other countries with a higher population.\r\nSource\r\nDeardorff, A., 2016. Tableau (version. 9.1). Journal of the Medical Library Association, 104(2), pp.182-183.\r\nSheikh, S. E. (2022) ‘Eight warmest years on record witness upsurge in climate change impacts’, World Meteorological Organization, 6 Nov. Available at: https://public.wmo.int/en/media/press-release/eight-warmest-years-record-witness-upsurge-climate-change-impacts\r\nHamilton, K. (2017) ‘Economic co-benefits of reducing CO2 emissions outweigh the cost of mitigation for most big emitters’, The London School of Economics and Political Science, 3 Nov. Available at: https://www.lse.ac.uk/granthaminstitute/news/economic-co-benefits-of-reducing-co2-emissions-outweigh-the-cost-of-mitigation-for-most-big-emitters/\r\nClimate Watch Org. (2020) ‘CO2 emissions (metric tons per capita)’. Available at: http://data.worldbank.org/indicator/EN.ATM.CO2E.PC\r\nAdema, S. (2022) ‘Understanding Qatar’s Ecological Footprint’, Ecomena, 1 March. Available at: https://www.ecomena.org/qatar-ecological-footprint/\r\nAl-Asmakh, M. and Al-Awainati, N., 2018, March. Counting the Carbon: Assessing Qatar’s Carbon Dioxide Emissions. In Qatar Foundation Annual Research Conference Proceedings Volume 2018 Issue 1 (Vol. 2018, No. 1, p. EEPD592). Hamad bin Khalifa University Press (HBKU Press).\r\n\r\n\r\n\r\n",
    "preview": "https://i.ytimg.com/vi/9OX9ohTcC1w/maxresdefault.jpg",
    "last_modified": "2023-01-10T10:26:40+07:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-12-13-fitness-trackers-e-commerce-in-indian-market/",
    "title": "Fitness Trackers e-Commerce in Indian Market",
    "description": "A financial analysis about fitness trackers device sales in Indian market on 2022.",
    "author": [
      {
        "name": "Miftahul Hadi",
        "url": {}
      }
    ],
    "date": "2022-12-06",
    "categories": [
      "R",
      "Financial Analysis",
      "Data Visualization"
    ],
    "contents": "\r\n\r\nContents\r\nIntroduction\r\nPreparation\r\nAnalysis\r\nConclusion\r\nSuggestion\r\nSource\r\n\r\nIntroduction\r\nIn this activity, I want to analyze a Fitness Trackers Device product from various brands. This report will analyze review about the device in Indian market. After that, we try to investigate the material used in the device including strap material, battery, and the price itself.\r\nFig. 1. Fitness Tracker DeviceHere, we used the data sets from Flipkart, one of an e-commerce website. This data sets include several variable such as:\r\nSelling Price\r\nSpecifications\r\nRatings\r\nReview from the Indian Market\r\nThis data has been collected using Kaggle in this link\r\nWhat to analyze?\r\nThis data set can be used to find a questions that might arise such as:\r\nWhat is the best strap material for Fitness Tracker Device?\r\nIs more battery life necessary for Smartwatches or Fitness Band?\r\nWhat is the mean price for selling a fitness tracker that might get at least 4.0 ratings?\r\nHopefully, this questions will reveal what inside the data sets and help other company to strategies the India Market.\r\nPreparation\r\nHere, I want to describe a few tools in this analysis:\r\nRStudio\r\nLibrary including:\r\ntidyverse\r\nggplot2\r\ndplyr\r\nreadr\r\nskimr\r\n\r\nDataset link\r\nBefore doing our analysis, we loaded the library.\r\n\r\n\r\nShow code\r\n\r\nlibrary(tidyverse)\r\nlibrary(ggplot2)\r\nlibrary(dplyr)\r\nlibrary(readr)\r\nlibrary(skimr)\r\nlibrary(formattable)\r\nlibrary(ggpubr)\r\n\r\n\r\nThen, load and name the dataset as a fitness_tracker using readr library.\r\n\r\n\r\nShow code\r\n\r\nlibrary(readr)\r\n\r\n#Use your file location\r\nfitness_trackers <- read_csv(\"D:/Bahan Belajar/Experience/Sertifikasi LinkedIn/Project/1_R_Fitness Tracker_ecommerce/Fitness_trackers.csv\")\r\n\r\n\r\nLast, we want to get better understanding of our data using glimpse() & skim_without_charts() to check the null value.\r\n\r\n\r\nshow\r\n\r\nglimpse(fitness_trackers)\r\n\r\nRows: 565\r\nColumns: 11\r\n$ `Brand Name`                     <chr> \"Xiaomi\", \"Xiaomi\", \"Xiaomi…\r\n$ `Device Type`                    <chr> \"FitnessBand\", \"FitnessBand…\r\n$ `Model Name`                     <chr> \"Smart Band 5\", \"Smart Band…\r\n$ Color                            <chr> \"Black\", \"Black\", \"Black\", …\r\n$ `Selling Price`                  <dbl> 2499, 2099, 1722, 2469, 179…\r\n$ `Original Price`                 <dbl> 2999, 2499, 2099, 2999, 219…\r\n$ Display                          <chr> \"AMOLED Display\", \"AMOLED D…\r\n$ `Rating (Out of 5)`              <dbl> 4.1, 4.2, 3.5, 4.1, 4.3, 4.…\r\n$ `Strap Material`                 <chr> \"Thermoplastic polyurethane…\r\n$ `Average Battery Life (in days)` <dbl> 14, 14, 14, 14, 7, 20, 7, 1…\r\n$ Reviews                          <dbl> NA, NA, NA, NA, NA, NA, NA,…\r\n\r\nshow\r\n\r\nskim_without_charts(fitness_trackers)\r\n\r\n(#tab:Understand the data)Data summary\r\nName\r\nfitness_trackers\r\nNumber of rows\r\n565\r\nNumber of columns\r\n11\r\n_______________________\r\n\r\nColumn type frequency:\r\n\r\ncharacter\r\n6\r\nnumeric\r\n5\r\n________________________\r\n\r\nGroup variables\r\nNone\r\nVariable type: character\r\nskim_variable\r\nn_missing\r\ncomplete_rate\r\nmin\r\nmax\r\nempty\r\nn_unique\r\nwhitespace\r\nBrand Name\r\n0\r\n1\r\n4\r\n8\r\n0\r\n19\r\n0\r\nDevice Type\r\n0\r\n1\r\n10\r\n11\r\n0\r\n2\r\n0\r\nModel Name\r\n0\r\n1\r\n1\r\n62\r\n0\r\n384\r\n0\r\nColor\r\n0\r\n1\r\n3\r\n44\r\n0\r\n134\r\n0\r\nDisplay\r\n0\r\n1\r\n11\r\n19\r\n0\r\n7\r\n0\r\nStrap Material\r\n0\r\n1\r\n5\r\n26\r\n0\r\n11\r\n0\r\nVariable type: numeric\r\nskim_variable\r\nn_missing\r\ncomplete_rate\r\nmean\r\nsd\r\np0\r\np25\r\np50\r\np75\r\np100\r\nSelling Price\r\n0\r\n1.00\r\n22110.37\r\n19914.93\r\n1195\r\n8990.00\r\n15995.0\r\n29900.00\r\n122090\r\nOriginal Price\r\n0\r\n1.00\r\n25365.36\r\n20384.03\r\n1599\r\n12999.00\r\n19995.0\r\n32900.00\r\n122090\r\nRating (Out of 5)\r\n51\r\n0.91\r\n4.23\r\n0.39\r\n2\r\n4.03\r\n4.3\r\n4.50\r\n5\r\nAverage Battery Life (in days)\r\n0\r\n1.00\r\n9.03\r\n7.87\r\n1\r\n2.00\r\n7.0\r\n14.00\r\n45\r\nReviews\r\n487\r\n0.14\r\n2492.95\r\n5607.53\r\n2\r\n107.75\r\n346.0\r\n1580.75\r\n23426\r\n\r\nAnalysis\r\nThe best strap material for Fitness Tracker Device?\r\nFitness Band Material\r\nHere, we try to find which strap material for Fitness Band is having a high average rating. The rating is obtained by calculating the average rating per strap material. Then do the ranking analysis.\r\n\r\n\r\nShow code\r\n\r\n#Fitness Band\r\n#Calculate the average rating by strap material\r\nmean_strap_fitnessband <- fitness_trackers %>% \r\n  group_by(`Strap Material`) %>%\r\n  filter (`Device Type` == \"FitnessBand\") %>% \r\n  summarize(avg_rating = mean(`Rating (Out of 5)`))\r\n\r\n#Plot the average rating with strap material\r\nggplot(data = mean_strap_fitnessband, \r\n       mapping = aes(x = avg_rating, y = reorder(`Strap Material`, avg_rating), alpha = avg_rating)) + \r\n  geom_bar(stat = \"identity\", fill = \"black\") + \r\n  geom_text(aes(label = round(avg_rating, digits = 2), fontface = \"bold\"), nudge_x = +0.2, colour = \"black\") +\r\n  labs(title = \"Rating for Fitness Band Material\", subtitle = \"based on Review in Indian Market\", x = \"Average Rating\", y = \"Strap Material\", alpha = \"Range of Rating\")\r\n\r\n\r\n\r\nFrom the bar chart above, we see the brand name on the left-axis with their average rating. Elastomer is getting highest rating in Indian market by 4.22. Then follow tightly by Plastic. The use of leather is less preferable for Fitness Band in Indian market.\r\nSmartwatch Material\r\nHere, we try to find which strap material for Smartwatch is having a high average rating. The rating is obtained by calculating the average rating per strap material. Then do the ranking analysis.\r\n\r\n\r\nShow code\r\n\r\n#Smartwatches\r\n#Calculate the average rating by strap material\r\nmean_strap_smartwatch <- fitness_trackers %>% \r\n  drop_na() %>% \r\n  group_by(`Strap Material`) %>%\r\n  filter (`Device Type` == \"Smartwatch\") %>% \r\n  summarize(avg_rating = mean(`Rating (Out of 5)`))\r\n\r\n#Plot the average rating with strap material\r\nggplot(data = mean_strap_smartwatch, \r\n       mapping = aes(x = avg_rating, y = reorder(`Strap Material`, avg_rating), alpha = avg_rating)) + \r\n  geom_bar(stat = \"identity\", fill = \"black\") + \r\n  geom_text(aes(label = round(avg_rating, digits = 2), fontface = \"bold\"), nudge_x = +0.2, colour = \"black\") +\r\n  labs(title = \"Rating for Smartwatch Material\", subtitle = \"based on Review in Indian Market\", x = \"Average Rating\", y = \"Strap Material\", alpha = \"Range of Rating\")\r\n\r\n\r\n\r\nFrom the bar chart above, we see that Nylon is getting highest rating in Indian market by 4.4. Then follow tightly by Silicone. The use of rubber is less preferable for smart watches in Indian market.\r\nIs more battery life necessary for Smartwatches or Fitness Band?\r\nHere, we want to inspect whether or not if more battery life is an important factor for having a high rating in Indian Market. To do that:\r\nTake the Battery Life and Rating Column.\r\nThen, show the relationship between them using scatter plot.\r\nHere’s the formula in R\r\n\r\n\r\nShow code\r\n\r\n#Plot the battery life with rating\r\nggplot(data = fitness_trackers, \r\n       mapping = aes(x = `Average Battery Life (in days)`, y = `Rating (Out of 5)`, alpha = `Rating (Out of 5)`)) + \r\n  geom_smooth() +\r\n  stat_cor(method = \"pearson\", label.x = -5, label.y = 4.8) +\r\n  facet_wrap(~`Device Type`) +\r\n  labs(title = \"Relationship between Battery Life vs. Rating\", subtitle = \"based on Review in Indian Market\", \r\n       x = \"Average Battery Life (in days)\", y = \"Rating\")\r\n\r\n\r\n\r\nFrom the scatter plot above, we see the average battery life (in days) on the x-axis with their rating on y-axis. Scatter plot is used to reveal a correlation between two or more variables. Correlation coefficient is used to show whether strong or not the correlation is. If R is positive and near 1, then battery life is dependent to rating.\r\nIn Fitness Band on the left, we see that there is no strong linear correlation between battery life and rating. The R on Fitness band is 0.12. It shows that little correlation between them. Rating above 4.00 is actually obtained in battery life that has at least 5 to 20 days.\r\nIn Smartwatch on the right, we see that the R on Fitness band is -0.18. It shows a little negative linear correlation. Less battery life and is sometimes get a high rating. Higher rating with above 4.5 is obtained on battery life below 5 days.\r\nMean price for selling a fitness tracker\r\nHere, we want to inspect the mean price for selling a fitness tracker in Indian Market. We want the mean price will get at least 4.0 rating. To do that:\r\nTake the Selling Price and Rating Column.\r\nThen, show the relationship between them using scatter plot.\r\nLastly, check the mean selling price that will get at least 4.0 rating.\r\nHere’s the formula in R to check the correlation for selling price in Smartwatch.\r\n\r\n\r\nShow code\r\n\r\n#Smartwatches\r\n#Calculate the mean selling prices\r\nmean_selling_smartwatch <- fitness_trackers %>% \r\n  group_by(`Rating (Out of 5)`) %>%\r\n  filter (`Device Type` == \"Smartwatch\") %>% \r\n  summarize(selling_price = mean(`Selling Price`))\r\n\r\n#Plot the average selling price with device rating\r\nggplot(data = mean_selling_smartwatch, \r\n       mapping = aes(x = `Rating (Out of 5)`, y = selling_price)) + \r\n  geom_smooth() + \r\n  stat_cor(method = \"pearson\") +\r\n  labs(title = \"Rating by Selling Price\", subtitle = \"on Smartwatch\", x = \"Device Rating\", y = \"Selling Price\")\r\n\r\n\r\n\r\nIf we see the chart above, the R value for Smartwatch’s selling price is low. So we unable to measure the mean selling price for getting higher rating, because little correlation between them.\r\nLet’s check the selling price in Fitness Band.\r\n\r\n\r\nShow code\r\n\r\n#Fitness band\r\n#Calculate the mean selling prices\r\nmean_selling_fitnessband <- fitness_trackers %>% \r\n  group_by(`Rating (Out of 5)`) %>%\r\n  filter (`Device Type` == \"FitnessBand\") %>% \r\n  summarize(selling_price = mean(`Selling Price`))\r\n\r\n#Plot the average selling price with device rating\r\nggplot(data = mean_selling_fitnessband, \r\n       mapping = aes(x = `Rating (Out of 5)`, y = selling_price)) + \r\n  geom_smooth() + \r\n  stat_cor(method = \"pearson\") +\r\n  labs(title = \"Rating by Selling Price\", subtitle = \"on Fitness Band\", x = \"Device Rating\", y = \"Selling Price\")+\r\n  annotate(\"text\", x = 4, y = 7000, label = \"The mean price to get more than 4.0 rating is ₹5,000\", fontface = \"bold\", angle = 25)+\r\n  annotate(\"segment\", x = 4, y = 2500, xend = 4, yend = 4900, arrow = arrow(type = \"closed\", length = unit(0.02, \"npc\")))\r\n\r\n\r\n\r\nWhen we see the R, the correlation between selling price and rating on Fitness Band is strong (0.76 out of 1). So, we can measure the mean price to get more than 4.0 rating.\r\nNext, the mean price to get more than 4.0 rating is ₹5,000. If the selling price is increasing, the rating tend to be higher. Then the specifications price is needed to see further analysis on selling prices.\r\nConclusion\r\nAfter doing an analysis about fitness tracker in Indian market on 2022, we can conclude that:\r\nStrap material for different device require different material. Elastomer is preferable for Fitness Band. But for Smartwatches, the use of Nylon is getting highest rating.\r\nMore battery life on fitness tracker device is not necessary to get higher rating.\r\nThe preferable selling price for Fitness Band is ₹ 5,000. For Smartwatches, the selling price unable to be measured because no correlation with ratings.\r\nSuggestion\r\nFor further analysis, the specifications price is needed. This is important to measure a material with the lowest price but getting highest ratings.\r\nSource\r\nRStudio\r\nFitness Tracker Dataset: Kaggle\r\n\r\n\r\n\r\n",
    "preview": "https://phoneradar.com/wp-content/uploads/2014/09/GetActive-Tapp.jpg",
    "last_modified": "2023-01-03T12:56:32+07:00",
    "input_file": {}
  }
]
